INSERT INTO public.barista_user (id, name, password)
VALUES (3, 'test', 'a2312e7955f7406a9d495f031998a372ab8827d820a19fcad2e219b0e9a8c8bb');

INSERT INTO public.dessert (id, name, price)
VALUES (1, 'twix', 70),
       (2, 'pie', 300);

INSERT INTO public.drink (id, name, price, size, is_coffee)
VALUES (1, 'Латте', 200, 0, true),
       (2, 'Капучино', 200, 0, true),
       (3, 'Капучино', 220, 1, true),
       (4, 'Латте', 220, 1, true),
       (5, 'Американо', 150, 0, true),
       (6, 'Флэт уайт', 200, 0, true),
       (7, 'Раф', 220, 0, true),
       (8, 'Раф', 250, 1, true),
       (9, 'Чай латте', 180, 0, false),
       (10, 'Чай латте', 200, 1, false),
       (11, 'Какао', 200, 0, false),
       (12, 'Какао', 220, 1, false),
       (13, 'Зеленый чай', 120, 0, false),
       (14, 'Зеленый чай', 140, 1, false),
       (15, 'Черный чай', 120, 0, false),
       (16, 'Черный чай', 140, 1, false),
       (17, 'Облепиховый чай', 120, 0, false),
       (18, 'Облепиховый чай', 140, 1, false);

INSERT INTO public.milk (id, name, price)
VALUES (1, 'безлактозное', 40),
       (2, 'соевое', 40),
       (3, 'миндальное', 40),
       (4, 'овсяное', 40),
       (5, 'кокосовое', 40),
       (6, 'банановое', 40),
       (7, 'классическое', 0);

INSERT INTO public.syrup (id, name, price)
VALUES (1, 'миндаль', 40),
       (2, 'кокос', 40),
       (9, 'шоколад', 40),
       (5, 'ваниль', 40),
       (4, 'лесной орех', 40),
       (7, 'лаванда', 40),
       (8, 'соленая карамель', 40),
       (11, 'клубника', 40),
       (3, 'банан', 40),
       (6, 'груша', 40),
       (10, 'мята', 40);
